<h2>Soal 1: Hello World to Python</h2>
    
Print Say Hello World to Python

In [1]:
print("Hello World Python")

Hello World Python

Expected Output : 

Hello World Python

<h2>Soal 2: Aritmatika di Python </h2>
    
- Buat statement pertambahan antara 2 number di Python
- Buat statement perkurangan antara 2 number di Python
- Buat statement perkalian antara 2 number di Python
- Buat statement pembagian antara 2 number di Python

In [19]:
print("10 + 5 =", 10+5)
print("10 - 5 =", 10-5)
print("10 * 5 =", 10*5)
print("10 / 5 =", 10/5)

10 + 5 = 15
10 - 5 = 5
10 * 5 = 50
10 / 5 = 2.0

<h2>Quiz 3: Assign Variable dan Tipe Data Integer, Float </h2>

- Buat suatu variabel a dan b, dimana a dan b adalah nilai bertipe data numeric
- Berikan suatu nilai bertipe data integer, hasil pembagian dari a dengan b
- Berikan suatu nilai bertipe data float, hasil pembagian dari a dengan b

In [15]:
a = 10
b = 5
print(int(a/b))
print(float(a/b))

2
2.0

<h2>Soal 4: String Operation </h2>

- masukan nama depan kamu kedalam suatu variable firstname
- masukan nama belakang kamu kedalam suatu variable lasname
- tampilkan suatu kalimat 'Hello sanbercode, saya firstname lastname! saya siap belajar python data science.'

In [11]:
firstname = "Mohammad Dwiantara"
lastname = "Mahardhika"
print("Hello sanbercode, saya ", firstname, " ",lastname,"! saya siap belajar python data science", sep="")

Hello sanbercode, saya Mohammad Dwiantara Mahardhika! saya siap belajar python data science

Expected Output :

Hello sanbercode, saya fauzan taufik! saya siap belajar python data science.

<h2>Soal 5: Tipe Data</h2>

Lengkapi code di bawah ini untuk menghasilkan output yang sesuai

In [3]:
p = 9.99999
q = 'the number: '
print(q + str(p))

the number: 9.99999

Expected Output :

the number: 9.99999

In [7]:
import pandas as pd

x = pd.Series([6,3,4,6])
df = pd.DataFrame({'kolom1': [50, 21], 'kolom2': ['a', 'b']})
df = df.assign(New = x)
df

   kolom1 kolom2  New
0      50      a    6
1      21      b    3

In [18]:
import pandas as pd

df7 = pd.DataFrame({'nama' :['Santi', 'Budi', 'Ayu', 'Santi', 'Budi', 'Ayu', 'Santi', 'Budi', 'Ayu'], 
                   'nilai' : [63,94,64,93,75,81,93,55,65 ], 'ranking' : [4,5,7,8,3,2,3,2,9]})
df7.groupby('nama',as_index=False).median()

    nama  nilai  ranking
0    Ayu     65        7
1   Budi     75        3
2  Santi     93        4